In [68]:
import pandas as pd
import sqlalchemy as sql

In [69]:
cta = pd.read_csv('CTA_-_Ridership_-_Daily_Boarding_Totals_20240212.csv')
mta = pd.read_csv('MTA_Monthly_Ridership___Traffic_Data__Beginning_January_2008.csv')

In [70]:
cta.head()

  service_date day_type     bus  rail_boardings  total_rides
0   01/01/2001        U  297192          126455       423647
1   01/02/2001        W  780827          501952      1282779
2   01/03/2001        W  824923          536432      1361355
3   01/04/2001        W  870021          550011      1420032
4   01/05/2001        W  890426          557917      1448343

In [71]:
mta.head()

        Month Agency  Ridership
0  01/01/2008    MNR    6453734
1  02/01/2008    MNR    6144377
2  03/01/2008    MNR    6602280
3  04/01/2008    MNR    6787480
4  04/01/2008    B&T   24900328

In [72]:
mta.Agency.unique()

array(['MNR', 'B&T', 'Bus', 'Subway', 'AAR', 'LIRR', 'SIR'], dtype=object)

In [73]:
mta.loc[mta.Agency == 'bus', 'transportation_type'] = 'bus'
mta.loc[mta.Agency != 'bus', 'transportation_type'] = 'metro'

In [74]:
mta = mta.rename(columns={'Ridership': 'ridership_count', 'Month': 'month'})

In [75]:
mta = mta.drop(columns ='Agency')

In [76]:
mta.head()

        month  ridership_count transportation_type
0  01/01/2008          6453734               metro
1  02/01/2008          6144377               metro
2  03/01/2008          6602280               metro
3  04/01/2008          6787480               metro
4  04/01/2008         24900328               metro

In [77]:
mta['city']=['New York'] * len(mta)

In [78]:
mta.head()

        month  ridership_count transportation_type      city
0  01/01/2008          6453734               metro  New York
1  02/01/2008          6144377               metro  New York
2  03/01/2008          6602280               metro  New York
3  04/01/2008          6787480               metro  New York
4  04/01/2008         24900328               metro  New York

In [79]:
cta.head()

  service_date day_type     bus  rail_boardings  total_rides
0   01/01/2001        U  297192          126455       423647
1   01/02/2001        W  780827          501952      1282779
2   01/03/2001        W  824923          536432      1361355
3   01/04/2001        W  870021          550011      1420032
4   01/05/2001        W  890426          557917      1448343

In [80]:
cta = cta.drop(columns =['day_type', 'total_rides'])

In [81]:
cta = cta.rename(columns={'service_date':'month'})

In [82]:
cta.head()

        month     bus  rail_boardings
0  01/01/2001  297192          126455
1  01/02/2001  780827          501952
2  01/03/2001  824923          536432
3  01/04/2001  870021          550011
4  01/05/2001  890426          557917

In [83]:
cta = pd.melt(cta, id_vars = ['month'], value_vars=['bus', 'rail_boardings'], var_name = 'transportation_type', value_name=
              'ridership_count')

In [84]:
cta.head()

        month transportation_type  ridership_count
0  01/01/2001                 bus           297192
1  01/02/2001                 bus           780827
2  01/03/2001                 bus           824923
3  01/04/2001                 bus           870021
4  01/05/2001                 bus           890426

In [85]:
cta.head()

        month transportation_type  ridership_count
0  01/01/2001                 bus           297192
1  01/02/2001                 bus           780827
2  01/03/2001                 bus           824923
3  01/04/2001                 bus           870021
4  01/05/2001                 bus           890426

In [86]:
cta.loc[cta.transportation_type == 'rail_boardings', 'transportation_type'] = 'metro'

In [87]:
cta.tail()

            month transportation_type  ridership_count
16797  10/27/2023               metro           373004
16798  10/28/2023               metro           275006
16799  10/29/2023               metro           185823
16800  10/30/2023               metro           367453
16801  10/31/2023               metro           390110

In [88]:
cta.head()

        month transportation_type  ridership_count
0  01/01/2001                 bus           297192
1  01/02/2001                 bus           780827
2  01/03/2001                 bus           824923
3  01/04/2001                 bus           870021
4  01/05/2001                 bus           890426

In [89]:
cta = cta.sort_values('month', ascending = True).reset_index(drop=True)

In [90]:
cta.head()

        month transportation_type  ridership_count
0  01/01/2001                 bus           297192
1  01/01/2001               metro           126455
2  01/01/2002               metro           122471
3  01/01/2002                 bus           294360
4  01/01/2003               metro           169985

In [91]:
cta['city']=['Chicago'] * len(cta)

In [92]:
cta.head()

        month transportation_type  ridership_count     city
0  01/01/2001                 bus           297192  Chicago
1  01/01/2001               metro           126455  Chicago
2  01/01/2002               metro           122471  Chicago
3  01/01/2002                 bus           294360  Chicago
4  01/01/2003               metro           169985  Chicago

In [93]:
monthly_totals = pd.concat([mta, cta], axis = 'rows')

In [95]:
engine = sql.create_engine('postgresql://postgres:Norasing3$@localhost:5432/postgres')

In [104]:
with engine.connect() as con:
    monthly_totals.to_sql('monthly_totals', con, if_exists='replace')
    for transportation_type in ['bus', 'metro']:
        query = f'''CREATE TABLE IF NOT EXISTS {transportation_type}_monthly_totals AS 
            SELECT month, ridership_count, city 
            FROM monthly_totals 
            WHERE transportation_type = '{transportation_type}';'''
        con.execute(sql.text(query))
        con.commit()